$(document).ready(function(){
  var jokes = [
    {
      "phrase": "Кукурузные хлопья - теперь без асбеста!",
      "signature": "© Неизвестный маркетолог"
    },
    {
      "phrase": "Собираюсь жить вечно, пока всё идёт нормально"
    },
    {
      "phrase": "Если ты будешь усердно работать по 8 часов в день, то обязательно станешь боссом и начнешь работать по 12"
    },
    {
      "phrase": "Всегда существует риск принять старого мудака за мудрого старика",
      "signature": "© Дмитрий Лавренков"
    },
    {
      "phrase": "Существует множество способов заставить женщину говорить, но нет ни одного, чтобы заставить ее умолкнуть."
    },
    {
      "phrase": "Только русский человек может прийти с больничного загорелым."
    },
    {
      "phrase": "С помощью дверей можно проходить через стены",
      "signature": "© Виталий Кличко"
    },
    {
      "phrase": "А самое страшное, что я узнал из рекламы, это то, что бактерии живут под ободком унитаза, а размножаются в полости рта…"
    },
    {
      "phrase": "Денег, которые я заработал, хватит мне до конца жизни, если я умру сегодня в 17.00"
    },
    {
      "phrase": "Дай человеку рыбу, и он будет сыт один день, научи его ловить рыбу, и он будет каждый выходной возвращаться пьяным с 3 карасями."
    }
  ]
  var random_number = Math.floor(Math.random() * jokes.length);
  var joke = jokes[random_number]['phrase'];
  var author = jokes[random_number]['signature'];
  $(".joke .text").text(joke);
  if(typeof(author)!="undefined") $(".joke .author").text(author);
});
